app/controllers/companies_controller.rb

  def index
    @companies = Company.all.order(:name)
---
SELECT "companies".* FROM "companies"   ORDER BY "companies"."name" ASC