app/controllers/conferences_controller.rb

  def index
    @conferences = Conference.all.order(:name)
---
SELECT "conferences".* FROM "conferences"   ORDER BY "conferences"."name" ASC