app/controllers/coworkings_controller.rb

SELECT "coworkings".* FROM "coworkings"   ORDER BY "coworkings"."name" ASC
---
  def index
    @coworkings = Coworking.all.order(:name)