app/controllers/meetups_controller.rb

SELECT "meetups".* FROM "meetups"   ORDER BY "meetups"."name" ASC
---
  def index
    @meetups = Meetup.all.order(:name)