app/controllers/resources_controller.rb

  def index
    @resources = Resource.all.order(:name)
---
SELECT "resources".* FROM "resources"   ORDER BY "resources"."name" ASC

  def create
    @resource = Resource.new(resource_params)
    @resource.save
---
INSERT INTO "resources" ("created_at", "description", "name", "twitter", "updated_at", "websitename", "websiteurl") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    @resource.update(resource_params)
---
UPDATE "resources" SET "description" = ?, "name" = ?, "updated_at" = ?, "websitename" = ?, "websiteurl" = ? WHERE "resources"."id" = 1  [["description", ""], ["name", "Entrepreneurs of Knoxville (EOK)"], ["updated_at", "2015-09-04 01:56:10.923661"], ["websitename", "eokhq.com"], ["websiteurl", "http://eokhq.com"]]

  def destroy
    @resource.destroy
---
DELETE FROM "resources" WHERE "resources"."id" = ?  [["id", 2]]

    def set_resource
      @resource = Resource.find(params[:id])
---
SELECT  "resources".* FROM "resources"  WHERE "resources"."id" = ? LIMIT 1  [["id", 2]]